# -*- coding: utf-8 -*-

# 관계연산자
# 크기의 대소를 비교하여 진리형 값으로 반환하는 연산자
# >, <, >=, <=, ==, !=

n1 = 10
n2 = 5

r = n1 > n2
print("{0} {1} {2} = {3}".format(
        n1, ">", n2, r))

r = n1 < n2
print("{0} {1} {2} = {3}".format(
        n1, "<", n2, r))

r = n1 >= n2
print("{0} {1} {2} = {3}".format(
        n1, ">=", n2, r))

r = n1 <= n2
print("{0} {1} {2} = {3}".format(
        n1, "<=", n2, r))

r = n1 == n2
print("{0} {1} {2} = {3}".format(
        n1, "==", n2, r))

r = n1 != n2
print("{0} {1} {2} = {3}".format(
        n1, "!=", n2, r))






